import React, { useState } from "react";
import {
  MapContainer,
  ImageOverlay,
  Marker,
  Popup,
  Polyline,
  LayersControl,
  LayerGroup,
  useMapEvents
} from "react-leaflet";
import L from "leaflet";
import "leaflet/dist/leaflet.css";

const bounds = [[0, 0], [905, 1280]];

const locations = {
  "בניין כניסה / יציאה": [414, 220],
  "חנות המוזיאון 1": [405, 283],
  "חנות המוזיאון 2": [438, 278],
  "מסעדה ובית קפה 1": [414, 220],
  "מסעדה ובית קפה 2": [433, 283],
  "המעבר המקורה": [435, 283],
  "מעלה קרטר": [456, 345],
  "אגף הנוער והחינוך לאמנות": [450, 360],
  "אגף לארכאולוגיה": [498, 497],
 "כניסה לאולמות  התצוגה": [550, 350],
  "רחבת אידה קראון": [500, 320],
 "כניסה לאולמות העיליונים": [440, 340],
  "ותרבות יהודית אמנות": [430, 320],
  "ספרייה": [484, 464],
  "אולם לתצוגות מיוחדות": [610, 684],
  "אמניות" : [584, 734],
  "גן האמנות": [520, 500],
  "היכל הספר": [280, 580],
  "העלאת דגם ירושלים בימי בית שני": [424, 234],
  "דגם ירושלים בימי בית שני": [380, 690],
  "אודיטוריום גליל הספר": [301, 536],
  "מודיעין": [526, 539],
  "מלתחה": [414, 220],
  "שירותים 1 (ליד מודיעין)": [526, 539],
  "שירותים 2 (ליד היכל הספר)": [513, 530],
  "גן האמנות": [520, 500]
};


const museumGraph = {
  "בניין כניסה / יציאה": ["חנות המוזיאון 1"],
  "חנות המוזיאון 1": ["חנות המוזיאון 2"],
  "חנות המוזיאון 2": ["מסעדה ובית קפה 1", "מסעדה ובית קפה 2"],
  "מסעדה ובית קפה 1": ["המעבר המקורה"],
  "מסעדה ובית קפה 2": ["המעבר המקורה"],
  "המעבר המקורה": ["מעלה קרטר"],
  "מעלה קרטר": ["אגף הנוער והחינוך לאמנות"],
  "אגף הנוער והחינוך לאמנות": ["אגף לארכאולוגיה"],
  "אגף לארכאולוגיה": ["גלריה לאמנות מודרנית"],
 "כניסה לאולמות  התצוגה": ["רחבת אידה קראון"],
  "רחבת אידה קראון": ["גלריה לאמנות עכשווית"],
 "כניסה לאולמות העיליונים": ["ותרבות יהודית אמנות"],
  "ותרבות יהודית אמנות": ["ספרייה"],
  "ספרייה": ["מודיעין"],
  "מודיעין": ["מלתחה"],
  "מלתחה": [
    "שירותים 1 (ליד מודיעין)",
    "שירותים 2 (ליד היכל הספר)",
    "היכל הספר"
  ],
  "היכל הספר": ["העלאת דגם ירושלים בימי בית שני"],
  "העלאת דגם ירושלים בימי בית שני": ["דגם ירושלים בימי בית שני"],
  "דגם ירושלים בימי בית שני": [],
  "גן האמנות": []
};


function makeBidirectional(graph) {
  const newGraph = { ...graph };
  for (const [from, tos] of Object.entries(graph)) {
    for (const to of tos) {
      if (!newGraph[to]) newGraph[to] = [];
      if (!newGraph[to].includes(from)) newGraph[to].push(from);
    }
  }
  return newGraph;
}

function findShortestPath(graph, start, end) {
  let queue = [[start]];
  const visited = new Set();
  while (queue.length) {
    const path = queue.shift();
    const node = path[path.length - 1];
    if (node === end) return path;
    if (!visited.has(node)) {
      visited.add(node);
      for (const neighbor of graph[node] || []) {
        queue.push([...path, neighbor]);
      }
    }
  }
  return null;
}

function ClickLogger({ setClickPos }) {
  useMapEvents({
    click(e) {
      const { lat, lng } = e.latlng;
      setClickPos([lat, lng]);
    },
  });
  return null;
}

const MuseumMap = () => {
  const [target, setTarget] = useState(null);
  const [clickPos, setClickPos] = useState(null);
  const graph = makeBidirectional(museumGraph);

 const customPaths = {
  "שירותים 2 (ליד היכל הספר)":[
   [422, 233],
    [438, 278],
    [433, 283],
    [456, 346]
  ],
  "מסעדה ובית קפה 1": [
    [414, 220]
  ],
   "אודיטוריום גליל הספר": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [366, 483],
    [323, 547],
    [318, 539]
    ],
    "דגם ירושלים בימי בית שני": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [366, 483],
    [323, 547],
    [333, 560],
    [335, 565],
    [337, 571],
    [338, 571],
    [340, 582],
    [340, 595],
    [338, 606],
    [334, 619],
    [328, 637],
    [322, 650],
    [314, 662],
    [306, 669],
    [298, 674],
    [289, 676],
    [279, 676],
    [ 271, 673],
    [261, 668],
    [251, 660],
    [256, 653]


    ],
   "העלאת דגם ירושלים בימי בית שני": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [366, 483],
    [323, 547]

   ],
  "היכל הספר": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [366, 483]

  ],
  "גן האמנות": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [504, 546],
    [518, 555],
    [521, 564],
    [506, 588]

  ],
  "אמניות" :[
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "אולם לתצוגות מיוחדות":[
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "ספרייה": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "ותרבות יהודית אמנות":[
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "כניסה לאולמות העיליונים": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "רחבת אידה קראון": [
     [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "כניסה לאולמות  התצוגה":[
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "אגף לארכאולוגיה":[
     [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "אגף הנוער והחינוך לאמנות":[
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346]
  ],
  "מעלה קרטר": [
    [424, 236],
    [411, 251],
    [410, 276],
    [404, 283],
    [424, 335]
  ],
  "המעבר המקורה": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346]
  ],
  "חנות המוזיאון 1": [
    [424, 236],
    [411, 251],
    [410, 276],
    [404, 283]
  ],
  "מסעדה ובית קפה 2":[
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "חנות המוזיאון 2": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "מודיעין": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "מלתחה": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  "שירותים 1 (ליד מודיעין)": [
    [422, 233],
    [438, 278],
    [433, 283],
    [456, 346],
    [439, 375],
    [477, 469],
    [486, 466],
    [513, 530],
    [529, 536]
  ],
  
  
};


  const customDestinations = new Set([
    "מודיעין",
    "מלתחה",
    "שירותים",
    "שירותים ליד היכל הספר",
    "אודיטוריום גליל הספר",
    "חנות המוזיאון",
    "אגף לארכאולוגיה",
   "כניסה לאולמות  התצוגה",
    "רחבת אידה קראון",
   "כניסה לאולמות העיליונים",
    "אמנות",
    "ספרייה"
  ]);

const path = target
  ? customPaths[target]
    ? customPaths[target]
    : findShortestPath(graph, "בניין כניסה / יציאה", target)
        ?.map((p) => locations[p]) || []
  : [];


  return (
    <div>
      <h2>מפת מוזיאון ישראל</h2>
      <select onChange={(e) => setTarget(e.target.value)} defaultValue="">
        <option value="" disabled>בחר יעד</option>
        {Object.keys(locations).map((loc) => (
          <option key={loc} value={loc}>{loc}</option>
        ))}
      </select>

      <MapContainer
        crs={L.CRS.Simple}
        bounds={bounds}
        style={{ height: "600px", marginTop: "1rem" }}
        zoom={-1} minZoom={-1} maxZoom={2} center={[600, 640]}
      >
        <ClickLogger setClickPos={setClickPos} />

        <LayersControl position="topright">
          <LayersControl.BaseLayer checked name="מפת המוזיאון">
            <ImageOverlay url="/images/museum_layout_leaflet.jpg" bounds={bounds} />
          </LayersControl.BaseLayer>

          <LayersControl.Overlay name="תערוכות">
            <LayerGroup>
              {[
                "המעבר המקורה",
                "מעלה קרטר",
                "אגף הנוער והחינוך לאמנות",
                "אגף לארכאולוגיה",
               "כניסה לאולמות  התצוגה",
                "רחבת אידה קראון",
               "כניסה לאולמות העיליונים",
                "אמנות",
                "ספרייה"
              ].map((place) => (
                <Marker key={place} position={locations[place]}>
                  <Popup>{place}</Popup>
                </Marker>
              ))}
            </LayerGroup>
          </LayersControl.Overlay>

          <LayersControl.Overlay name="חנויות ובתי קפה">
            <LayerGroup>
              {["חנות המוזיאון", "מסעדה ובית קפה"].map((place) => (
                <Marker key={place} position={locations[place]}>
                  <Popup>{place}</Popup>
                </Marker>
              ))}
            </LayerGroup>
          </LayersControl.Overlay>

          <LayersControl.Overlay name="שירותים ומידע">
            <LayerGroup>
              {[
                "מודיעין",
                "מלתחה",
                "שירותים",
                "שירותים ליד היכל הספר",
                "אודיטוריום גליל הספר"
              ].map((place) => (
                <Marker key={place} position={locations[place]}>
                  <Popup>{place}</Popup>
                </Marker>
              ))}
            </LayerGroup>
          </LayersControl.Overlay>

          <LayersControl.Overlay name="היכל ודגם ירושלים">
            <LayerGroup>
              {[
                "היכל הספר",
                "העלאת דגם ירושלים בימי בית שני",
                "דגם ירושלים בימי בית שני",
                "גן האמנות"
              ].map((place) => (
                <Marker key={place} position={locations[place]}>
                  <Popup>{place}</Popup>
                </Marker>
              ))}
            </LayerGroup>
          </LayersControl.Overlay>

         {path.length > 1 && (
  <Polyline
    positions={path}
    color="blue"
    weight={4}
    lineCap="round"
    lineJoin="round"
  />
)}

          {clickPos && (
            <Marker position={clickPos}>
              <Popup>מיקום נבחר: {clickPos.map((v) => Math.round(v)).join(", ")}</Popup>
            </Marker>
          )}
        </LayersControl>
      </MapContainer>
    </div>
  );
};

export default MuseumMap;
